lesson_2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-08-06 Sun 21:40 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Lesson 2: Collections</title>
<meta name="author" content="Gabriel Cardozo" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Inconsolata|Open Sans">
<link rel="stylesheet" href="style.css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">Lesson 2: Collections</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org68b5bd0">1. Lists</a>
<ul>
<li><a href="#org015a5f4">1.1. Iterating Through Lists</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
So far we&rsquo;ve mostly talked about simple types that represent a single object. Sometimes we want to represent an object which contains several other objects. There are many container types. We&rsquo;ll go over some of the important ones here.
</p>

<div id="outline-container-org68b5bd0" class="outline-2">
<h2 id="org68b5bd0"><span class="section-number-2">1.</span> Lists</h2>
<div class="outline-text-2" id="text-1">
<p>
A list is an ordered collection, where items are accessed by their position in the list. In Python, we can create a list using square brackets, wrapped around a comma separated list of expressions. These expressions will be evaluated and placed in the list.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #6c7086;"># </span><span style="color: #6c7086;">`chr` function converts an ascii code to a character</span>
<span style="color: #cdd6f4;">grades</span> = [<span style="color: #f38ba8;">chr</span>(<span style="color: #fab387;">65</span>), <span style="color: #a6e3a1;">"B"</span>, <span style="color: #a6e3a1;">"C"</span>, <span style="color: #a6e3a1;">"D"</span>, <span style="color: #a6e3a1;">"F"</span>]

<span style="color: #f38ba8;">print</span>(grades)
</pre>
</div>

<details>
<summary>Output</summary>
<div class="org-src-container">
<pre class="src src-nil">['A', 'B', 'C', 'D', 'F']
</pre>
</div>
</details>

<p>
One can also access elements of a list using square brackets. To do this, name the list, then put an expression that evaluates to the index of the element of the list that you wish to access inside some square brackets to the right of the list name.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #cdd6f4;">grades</span> = [<span style="color: #a6e3a1;">"A"</span>, <span style="color: #a6e3a1;">"B"</span>, <span style="color: #a6e3a1;">"C"</span>, <span style="color: #a6e3a1;">"D"</span>, <span style="color: #a6e3a1;">"F"</span>]

<span style="color: #f38ba8;">print</span>(<span style="color: #a6e3a1;">"The first grade in the list is: "</span> + grades[<span style="color: #fab387;">0</span>])
</pre>
</div>

<details>
<summary>Output</summary>
<div class="org-src-container">
<pre class="src src-nil">The first grade in the list is: A
</pre>
</div>
</details>
<p>
Notice that index 0 refers to the first element of the list. In a programming context, 0 is usually considered the first number. In many contexts, this &ldquo;zero indexing&rdquo; is actually useful, and allows one to write neater code. Sometimes, however, you will forget that lists start with index 0, and this will result in a bug - everyone does it. If you make a mistake while writing code, it is likely a mistake everyone who has written code for a comparable amount of time has made. If everyone has made that mistake, it doesn&rsquo;t make you stupid to commit it. On the other hand, if you make a mistake no one else has ever made, you are probably a genius and should be given a medal.
</p>
</div>

<div id="outline-container-org015a5f4" class="outline-3">
<h3 id="org015a5f4"><span class="section-number-3">1.1.</span> Iterating Through Lists</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Consider the following snippet:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #cdd6f4;">grades</span> = [<span style="color: #a6e3a1;">"A"</span>, <span style="color: #a6e3a1;">"B"</span>, <span style="color: #a6e3a1;">"C"</span>, <span style="color: #a6e3a1;">"D"</span>, <span style="color: #a6e3a1;">"F"</span>]
<span style="color: #6c7086;"># </span><span style="color: #6c7086;">Indices: 0,   1,   2,   3,   4</span>
<span style="color: #6c7086;"># </span><span style="color: #6c7086;">Note that there are 5 elements in the list</span>

<span style="color: #f38ba8;">print</span>(<span style="color: #a6e3a1;">"The possible grades in a standard US classroom are:"</span>)

current_index = <span style="color: #fab387;">0</span>

<span style="color: #6c7086;"># </span><span style="color: #6c7086;">The `len` function takes a list, and returns the number of items in said list</span>
<span style="color: #cba6f7;">while</span> current_index &lt; <span style="color: #f38ba8;">len</span>(grades):
    <span style="color: #6c7086;"># </span><span style="color: #6c7086;">We only want commas before every item but the first</span>
    <span style="color: #cba6f7;">if</span> current_index &gt; <span style="color: #fab387;">0</span>:
        <span style="color: #6c7086;"># </span><span style="color: #6c7086;">Adding `end=""` to the arguments of a print statement stops it printing a newline after whatever you print.</span>
        <span style="color: #f38ba8;">print</span>(<span style="color: #a6e3a1;">", "</span>, end=<span style="color: #a6e3a1;">""</span>)
    <span style="color: #f38ba8;">print</span>(grades[current_index], end=<span style="color: #a6e3a1;">""</span>)

    current_index = current_index + <span style="color: #fab387;">1</span>
<span style="color: #f38ba8;">print</span>(<span style="color: #a6e3a1;">"!"</span>)
</pre>
</div>

<details>
<summary>Output</summary>
<div class="org-src-container">
<pre class="src src-nil">The possible grades in a standard US classroom are:
A, B, C, D, F!
</pre>
</div>
</details>

<p>
Zero indexing allows us to use the <code>&lt;</code> operator with the length of the list to make sure that a value is a valid index.
</p>

<p>
We often find ourselves going through every item in a list like the above. As fun as writing that little counter was, in general, writing less code is better, so Python provides a shortcut:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #cdd6f4;">grades</span> = [<span style="color: #a6e3a1;">"A"</span>, <span style="color: #a6e3a1;">"B"</span>, <span style="color: #a6e3a1;">"C"</span>, <span style="color: #a6e3a1;">"D"</span>, <span style="color: #a6e3a1;">"F"</span>]
<span style="color: #6c7086;"># </span><span style="color: #6c7086;">Indices: 0,   1,   2,   3,   4</span>
<span style="color: #6c7086;"># </span><span style="color: #6c7086;">Note that there are 5 elements in the list</span>

<span style="color: #f38ba8;">print</span>(<span style="color: #a6e3a1;">"The possible grades in a standard US classroom are:"</span>)

<span style="color: #cba6f7;">for</span> grade <span style="color: #cba6f7;">in</span> grades:
    <span style="color: #cba6f7;">if</span> grade != <span style="color: #a6e3a1;">"A"</span>:
        <span style="color: #6c7086;"># </span><span style="color: #6c7086;">Adding `end=""` to the arguments of a print statement stops it printing a newline after whatever you print.</span>
        <span style="color: #f38ba8;">print</span>(<span style="color: #a6e3a1;">", "</span>, end=<span style="color: #a6e3a1;">""</span>)
    <span style="color: #f38ba8;">print</span>(grade, end=<span style="color: #a6e3a1;">""</span>)
<span style="color: #f38ba8;">print</span>(<span style="color: #a6e3a1;">"!"</span>)
</pre>
</div>

<details>
<summary>Output</summary>
<div class="org-src-container">
<pre class="src src-nil">The possible grades in a standard US classroom are:
A, B, C, D, F!
</pre>
</div>
</details>

<p>
A for loop is a statement that can be used to replace while loops when you want to iterate through each value in a collection. A for loop has the <code>for</code> keyword, a name used to refer to the items in the collection, the <code>in</code> keyword, a collection expression, a colon, and a code block. For each item in the collection, the name is assigned to that item&rsquo;s value, and the code block is run. The name used to refer to the collection items can be used within the code block. For loops are also called &ldquo;for each&rdquo; loops - reading the <code>for</code> keyword as &ldquo;for each&rdquo; may make more sense to you. Look at the code above again and give it a try!
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Gabriel Cardozo</p>
<p class="date">Created: 2023-08-06 Sun 21:40</p>
</div>
</body>
</html>